plugins/roc/dataserver/DABCParameters-lxg0517.gsi.de:1982-Worker:42-Demo.xml

<soap-env:Envelope soap-env:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"><soap-env:Header/><soap-env:Body><xdaq:properties xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xdaq="urn:xdaq-soap:3.0" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="soapenc:Struct"><xdaq:BufferSize.RocPlugin xsi:type="xsd:integer">16384</xdaq:BufferSize.RocPlugin><xdaq:CoreState xsi:type="xsd:string">Ready</xdaq:CoreState><xdaq:DABCVersion xsi:type="xsd:string">DABC Control 00.09.08(Aug  6 2008|12:46:02)</xdaq:DABCVersion><xdaq:DataServerKind.RocPlugin xsi:type="xsd:string">Transport</xdaq:DataServerKind.RocPlugin><xdaq:DumpMode.RocPlugin xsi:type="xsd:integer">1</xdaq:DumpMode.RocPlugin><xdaq:HostIP.RocPlugin xsi:type="xsd:string">140.181.80.154</xdaq:HostIP.RocPlugin><xdaq:InfoMessage xsi:type="soapenc:Struct"><xdaq:color xsi:type="xsd:string">Green</xdaq:color><xdaq:info xsi:type="xsd:string">Saved all parameters to DABCParameters-lxg0517.gsi.de:1982-Worker:42-- no parameter -.xml </xdaq:info><xdaq:verbosity xsi:type="xsd:integer">1</xdaq:verbosity></xdaq:InfoMessage><xdaq:MakeMbsEvents.RocPlugin xsi:type="xsd:integer">1</xdaq:MakeMbsEvents.RocPlugin><xdaq:Nodelist xsi:type="xsd:string">lxg0517.gsi.de:1982</xdaq:Nodelist><xdaq:NumRocs.RocPlugin xsi:type="xsd:integer">1</xdaq:NumRocs.RocPlugin><xdaq:PoolBuffers.RocPlugin xsi:type="xsd:integer">250</xdaq:PoolBuffers.RocPlugin><xdaq:PoolName.RocPlugin xsi:type="xsd:string">RocServerPool</xdaq:PoolName.RocPlugin><xdaq:QueueLength.RocPlugin xsi:type="xsd:integer">50</xdaq:QueueLength.RocPlugin><xdaq:RecvTimeout.RocPlugin xsi:type="xsd:integer">10</xdaq:RecvTimeout.RocPlugin><xdaq:RocIp0.RocPlugin xsi:type="xsd:string">140.181.66.173</xdaq:RocIp0.RocPlugin><xdaq:RocIp1.RocPlugin xsi:type="xsd:string"/><xdaq:RocIp2.RocPlugin xsi:type="xsd:string"/><xdaq:RocIp3.RocPlugin xsi:type="xsd:string"/><xdaq:RocIp4.RocPlugin xsi:type="xsd:string"/><xdaq:RocReadout0.ROC_Readout xsi:type="soapenc:Struct"><xdaq:color xsi:type="xsd:string">Blue</xdaq:color><xdaq:colorAlarm xsi:type="xsd:string">Yellow</xdaq:colorAlarm><xdaq:displayMode xsi:type="xsd:integer">1</xdaq:displayMode><xdaq:loAlarm xsi:type="xsd:float">0.000000</xdaq:loAlarm><xdaq:loLimit xsi:type="xsd:float">0.000000</xdaq:loLimit><xdaq:rate xsi:type="xsd:float">0.000000</xdaq:rate><xdaq:units xsi:type="xsd:string">MB/s</xdaq:units><xdaq:upAlarm xsi:type="xsd:float">0.000000</xdaq:upAlarm><xdaq:upLimit xsi:type="xsd:float">0.000000</xdaq:upLimit></xdaq:RocReadout0.ROC_Readout><xdaq:RunStatus xsi:type="soapenc:Struct"><xdaq:color xsi:type="xsd:string">Cyan</xdaq:color><xdaq:severity xsi:type="xsd:integer">0</xdaq:severity><xdaq:status xsi:type="xsd:string">Ready</xdaq:status></xdaq:RunStatus><xdaq:SetParameter.ROC_Readout_ xsi:type="xsd:string">&lt;command name="SetParameter" scope="public"&gt;
  &lt;argument name="ParName" type="C" value="" required="true"/&gt;
  &lt;argument name="ParValue" type="C" value="" required="true"/&gt;
&lt;/command&gt;
</xdaq:SetParameter.ROC_Readout_><xdaq:SetPriority.ROC_Readout_ xsi:type="xsd:string">&lt;command name="SetPriority" scope="public"&gt;
  &lt;argument name="Priority" type="I" value="" required="true"/&gt;
&lt;/command&gt;
</xdaq:SetPriority.ROC_Readout_><xdaq:State xsi:type="xsd:string">Ready</xdaq:State><xdaq:ThreadName.RocPlugin xsi:type="xsd:string">RocReadoutThread</xdaq:ThreadName.RocPlugin><xdaq:UdpControlPort.RocPlugin xsi:type="xsd:integer">13132</xdaq:UdpControlPort.RocPlugin><xdaq:UdpDataPort.RocPlugin xsi:type="xsd:integer">13131</xdaq:UdpDataPort.RocPlugin><xdaq:controllerTid xsi:type="xsd:unsignedInt">41</xdaq:controllerTid><xdaq:debugLevel xsi:type="xsd:integer">1</xdaq:debugLevel><xdaq:descriptor xsi:type="soapenc:Struct"><xdaq:properties xsi:type="soapenc:Struct"><xdaq:class xsi:type="xsd:string">dabc::xd::Worker</xdaq:class><xdaq:className xsi:type="xsd:string">dabc::xd::Worker</xdaq:className><xdaq:context xsi:type="xsd:string">http://lxg0517.gsi.de:1982</xdaq:context><xdaq:group xsi:type="xsd:string">default</xdaq:group><xdaq:hasInstance xsi:type="xsd:string">true</xdaq:hasInstance><xdaq:id xsi:type="xsd:string">42</xdaq:id><xdaq:instance xsi:type="xsd:string">1</xdaq:instance><xdaq:network xsi:type="xsd:string">local</xdaq:network><xdaq:uuid xsi:type="xsd:string">f0137569-42d8-47c2-827c-200e47d619c0</xdaq:uuid></xdaq:properties></xdaq:descriptor><xdaq:heartbeatPeriod xsi:type="xsd:unsignedInt">5</xdaq:heartbeatPeriod><xdaq:nodeId xsi:type="xsd:unsignedInt">1</xdaq:nodeId><xdaq:runningTime xsi:type="xsd:unsignedInt">720</xdaq:runningTime><xdaq:startTime xsi:type="xsd:unsignedInt">1218455822</xdaq:startTime><xdaq:statusMessage xsi:type="xsd:string">Saved all parameters to DABCParameters-lxg0517.gsi.de:1982-Worker:42-- no parameter -.xml </xdaq:statusMessage><xdaq:stub xsi:type="soapenc:Struct"><xdaq:properties xsi:type="soapenc:Struct"/></xdaq:stub><xdaq:workerTid xsi:type="xsd:unsignedInt">42</xdaq:workerTid></xdaq:properties></soap-env:Body></soap-env:Envelope>